In [1]:
import pandas as pd 

adf = pd.DataFrame(data={'x1': ['A', 'B', 'C'], 'x2': [1, 2, 3]})

In [2]:
adf

  x1  x2
0  A   1
1  B   2
2  C   3

In [3]:
bdf = pd.DataFrame(data={'x1': ['A', 'B', 'D'], 'x3' : ['T', 'F', 'T']})

In [4]:
bdf

  x1 x3
0  A  T
1  B  F
2  D  T

In [5]:
pd.merge(adf, bdf, how='left')

  x1  x2   x3
0  A   1    T
1  B   2    F
2  C   3  NaN

In [6]:
pd.merge(adf, bdf, how='right')

  x1   x2 x3
0  A  1.0  T
1  B  2.0  F
2  D  NaN  T

In [9]:
pd.merge(adf, bdf, how='inner') # or pd.merge(adf, bdf) accomplishes the same; defaults to inner

  x1  x2 x3
0  A   1  T
1  B   2  F

In [14]:
pd.merge(adf, bdf, how='outer')

  x1   x2   x3
0  A  1.0    T
1  B  2.0    F
2  C  3.0  NaN
3  D  NaN    T

In [15]:
cdf = pd.DataFrame(data={'x1': ['A', 'B', 'C'], 'x3': ['T', 'F', 'T']})
df = pd.concat([adf, cdf], ignore_index=True)

/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:2: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

In [16]:
df

  x1   x2   x3
0  A  1.0  NaN
1  B  2.0  NaN
2  C  3.0  NaN
3  A  NaN    T
4  B  NaN    F
5  C  NaN    T

In [17]:
df = pd.DataFrame([[1, 2], [3, 4]], columns = ['a', 'b'])
df2 = pd.DataFrame([[5, 6], [7, 8]], columns =['a', 'b'])
df = df.append(df2, ignore_index=True)

In [18]:
df

   a  b
0  1  2
1  3  4
2  5  6
3  7  8

In [19]:
import numpy as np
df = pd.DataFrame({'a': [1, 10, 8, 11, -1],'b': list('abdce'), 'c': [1.0, 2.0, np.nan, 3.0, 4.0]})

In [20]:
df

    a  b    c
0   1  a  1.0
1  10  b  2.0
2   8  d  NaN
3  11  c  3.0
4  -1  e  4.0

In [23]:
df.nlargest(3, 'c')

    a  b    c
4  -1  e  4.0
3  11  c  3.0
1  10  b  2.0

In [25]:
df.isnull().sum()

a    0
b    0
c    1
dtype: int64

In [26]:
data = {'weekday': ["Monday", "Tuesday", "Wednesday", 
         "Thursday", "Friday", "Saturday", "Sunday"],
        'Person 1': [12, 6, 5, 8, 11, 6, 4],
        'Person 2': [10, 6, 11, 5, 8, 9, 12],
        'Person 3': [8, 5, 7, 3, 7, 11, 15]}
df = pd.DataFrame(data, columns=['weekday',
        'Person 1', 'Person 2', 'Person 3'])

In [27]:
df

     weekday  Person 1  Person 2  Person 3
0     Monday        12        10         8
1    Tuesday         6         6         5
2  Wednesday         5        11         7
3   Thursday         8         5         3
4     Friday        11         8         7
5   Saturday         6         9        11
6     Sunday         4        12        15

In [ ]:
melted = pd.melt (df, id_vars=["weekday"], var_name="Person")